tests/Amadeus/Client/Session/Handler/testfiles/dummyPnrRequest.txt

<?xml version="1.0" encoding="UTF-8"?> <SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://xml.amadeus.com/PNRRET_14_2_1A" xmlns:ns2="http://www.w3.org/2005/08/addressing" xmlns:ns3="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wsswssecurity-secext-1.0.xsd" xmlns:ns4="http://xml.amadeus.com/2010/06/Security_v1"><SOAP-ENV:Header><ns2:MessageID>FAEA565D-566D-4AD8-ACDF-3A144007151E</ns2:MessageID><ns2:Action>http://webservices.amadeus.com/PNRRET_14_2_1A</ns2:Action><ns2:To>https://dummy.endpoint/ENDPOINT</ns2:To><oas:Security xmlns:oas="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">     <oas:UsernameToken xmlns:oas1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" oas1:Id="UsernameToken-1"> 		<oas:Username>USERID</oas:Username> 		<oas:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">NONCE</oas:Nonce> 		<oas:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">PWDIGEST</oas:Password> 		<oas1:Created>2016-01-27T16:40:36:497Z</oas1:Created>     </oas:UsernameToken> </oas:Security><ns4:AMA_SecurityHostedUser><ns4:UserID POS_Type="1" PseudoCityCode="OFFICE" AgentDutyCode="SU" RequestorType="U"/></ns4:AMA_SecurityHostedUser></SOAP-ENV:Header><SOAP-ENV:Body><ns1:PNR_Retrieve><ns1:retrievalFacts><ns1:retrieve><ns1:type>2</ns1:type></ns1:retrieve><ns1:reservationOrProfileIdentifier><ns1:reservation><ns1:controlNumber>25YDLB</ns1:controlNumber></ns1:reservation></ns1:reservationOrProfileIdentifier></ns1:retrievalFacts></ns1:PNR_Retrieve></SOAP-ENV:Body></SOAP-ENV:Envelope>
